app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "9"]]
UPDATE "events" SET "name" = ?, "starts_at" = ?, "updated_at" = ? WHERE "events"."id" = 1  [["name", "BugSmashes"], ["starts_at", Sun, 22 Mar 2015 07:38:00 UTC +00:00], ["updated_at", Fri, 12 Dec 2014 12:58:25 UTC +00:00]]
---
  def update
    @event = Event.find(params[:id])
    if @event.update(event_params)

INSERT INTO "events" ("capacity", "created_at", "description", "image_file_name", "location", "name", "price", "starts_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(event_params)
    if @event.save